; domain
;; This is a plain STRIPS formulation of the Shakey's world domain.

(define (domain shakey_world_domain)
  (:requirements
   :strips
   )

  (:predicates
  (is-room ?r) ; is the room existing
  (is-shakey ?s) ; is shakey existing
  (is-box ?box) ; is the box existing
  (are-linked ?r1 ?r2 ?d) ; are the rooms linked by a door
  (is-at ?any-objects ?room) ; is any object in the room
  (is-wide-door ?d )        ; is it a wide door
  (is-light-on ?r)     		 ; is light on in the room
   )

; action : shakey moves from one room to another
   (:action moves
     :parameters (?s ?room-a ?room-b ?door)
     :precondition (and
       (is-shakey ?s)(is-at ?s ?room-a)
       (is-room ?room-a)(is-room ?room-b)
       (are-linked ?room-a ?room-b ?door)
     )
     :effect (and
       (is-at ?s ?room-b)
       (not (is-at ?s ?room-a) )
     )
   )

; action : shakey turns the light on
   (:action turns_lights_on
     :parameters (?s ?box ?room)
     :precondition (and
       (is-shakey ?s)(is-at ?s ?room)
       (is-box ?box)(is-at ?box ?room)
       (is-room ?room)
       (not (is-light-on ?room) )
     )
     :effect (is-light-on ?room)
   )

; action : shakey pushes the box
   (:action pushes_box
     :parameters (?s ?box ?room-a ?room-b ?wide-door)
     :precondition (and
       (is-shakey ?s)(is-at ?s ?room-a)
       (is-box ?box)(is-at ?box ?room-a)
       (is-room ?room-a)(is-room ?room-b)
       (is-wide-door ?wide-door)
       (are-linked ?room-a ?room-b ?wide-door)
     )
     :effect (and
       (is-at ?box ?room-b)
       (not (is-at ?box ?room-a) )
     )
   )
)

; problem
;; This is a concrete problem formulation of the Shakey's world domain.

;; Usage: ./FF-v2.3/ff -o shakey_world_domain.pddl -f shakey_world_problem_def.pddl

(define (problem shakey_world_problem_def)
  (:domain shakey_world_domain)

  (:objects
	r1 r2 r3	; room
	d1 d2	d3	; door
	b   		; box
	s		 ; shackey
  )

  (:init
  (is-room r1) (is-room r2) (is-room r3)
  (is-wide-door d1) (is-wide-door d2) (not(is-wide-door d3))
  (are-linked r1 r2 d1) (are-linked r2 r3 d2) (are-linked r2 r3 d3)
  (are-linked r2 r1 d1) (are-linked r3 r2 d2) (are-linked r3 r2 d3)
	(is-shakey s) (is-at s r2)
	(is-box b)(is-at b r1)
  (not (is-light-on r1) )
  (not (is-light-on r2) )
  (not (is-light-on r3) )
  )

  (:goal
  (and (is-light-on r1)
       (is-light-on r2)
       (is-light-on r3))
  )
)

; plan
1. (moves s r2 r1 d1)
   deleted: (is-at s r2)
   added: (is-at s r1)
   goals met: 0 of 3
2. (turns_lights_on s b r1)
   added: (is-light-on r1)
   goals met: 1 of 3
3. (pushes_box s b r1 r2 d1)
   deleted: (is-at b r1)
   added: (is-at b r2)
   goals met: 1 of 3
4. (moves s r1 r2 d1)
   deleted: (is-at s r1)
   added: (is-at s r2)
   goals met: 1 of 3
5. (turns_lights_on s b r2)
   added: (is-light-on r2)
   goals met: 2 of 3
6. (pushes_box s b r2 r3 d2)
   deleted: (is-at b r2)
   added: (is-at b r3)
   goals met: 2 of 3
7. (moves s r2 r3 d2)
   deleted: (is-at s r2)
   added: (is-at s r3)
   goals met: 2 of 3
8. (turns_lights_on s b r3)
   added: (is-light-on r3)
   goals met: 3 of 3
